---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.SpaceConstruction
source: html/28db4dc0-4c8e-2d93-11aa-6a1b9f1da589.htm
---
# Autodesk.Revit.DB.Mechanical.Space.SpaceConstruction Property

Get the Space Construction of the Space.

## Syntax (C#)
```csharp
public MEPSpaceConstruction SpaceConstruction { get; }
```

## Remarks
This property is used to get the Space Construction of the Space.